<script>
import { mapState, mapGetters, mapMutations } from 'vuex'
export default {
  name: 'playerItem',
  data () {
    return {
      audio: require('@/style/audio/宇多田ヒカル椎名林檎-二時間だけのバカンス (只有两小时的假期).mp3'),
      // 控制播放
      isPlay: false,
      // 控制播放器显示
      isShow: false,
      // 总时长
      endTime: 0,
      // 播放时间
      firstTime: 0,
      // 进度条
      sliderValue: 0,
      maxValue: 0,
      // 音量大小
      volume: 0,
      // 控制播放队列显示
      isDrawer: false
    }
  },
  methods: {
    // 播放暂停
    play () {
      this.isPlay = !this.isPlay
      if (this.isPlay) {
        this.$refs.audio.play()
      } else {
        this.$refs.audio.pause()
      }
    },
    // 播放时
    current (e) {
      this.firstTime = e.target.currentTime
      this.sliderValue = (this.firstTime / this.endTime) * 100
    },
    // 时间转换
    formatTime (seconds) {
      const minutes = Math.floor(seconds / 60)
      const secs = Math.floor(seconds % 60)
      return `${minutes}:${secs < 10 ? '0' : ''}${secs}`
    },
    // 进度条
    dragChange (value) {
      const audio = this.$refs.audio
      audio.currentTime = (value / 100) * this.endTime
    },
    // 加载完成
    loadMetadata (e) {
      this.endTime = e.target.duration
      // this.maxValue = e.target.duration
      this.volume = e.target.volume * 100
    },
    // 是否循环
    isLoop (e) {
      this.$refs.audio.loop = !this.$refs.audio.loop
      if (this.$refs.audio.loop) {
        e.target.style.fill = '#409EFF'
      } else e.target.style.fill = 'currentcolor'
    },
    // 改变音量
    volumeChange (value) {
      this.$refs.audio.volume = value * 0.01
    },
    ...mapMutations('playlist', ['nextSong', 'lastSong']),
    overPlay () {
      this.sliderValue = 0
      this.nextSong()
    }
  },
  computed: {
    ...mapState('playlist', ['playlist']),
    ...mapGetters('playlist', ['firstPlayList'])
  },
  mounted () {
    // 改变进度条样式
    // const element = document.querySelector('.progress-bar .el-slider__runway .el-slider__button-wrapper .el-slider__button')
    // element.style.backgroundColor = 'transparent'
    // element.style.border = '2px solid transparent'
  },
  watch: {
    playlist: {
      handler (newVal, oldVal) {
        this.isShow = true
        this.isPlay = true
        setTimeout(() => {
          this.$refs.audio.play()
        }, 500)
      }
    }
  }
}
</script>

<template>
  <div class="player" v-if="isShow">
    <div class="player-left">
      <el-image class="image" :src="firstPlayList.image"></el-image>
      <div class="player-left-info">
        <i>{{firstPlayList.name}}</i>
        <i>{{firstPlayList.singerName}}</i>
      </div>
    </div>
    <div class="play-controller">
      <div class="contr-top">
        <audio
          ref="audio"
          :src="audio"
          @ended="overPlay"
          @loadedmetadata="loadMetadata"
          @timeupdate="current"
          style="width: 100%"
        />
        <div class="contr-top-left direction">
          <button class="btn">
            <svg class="icon" viewBox="0 0 1024 1024" xmlns="http://www.w3.org/2000/svg" width="20" height="20"><path d="M753.564731 337.471035c-45.8697 0-160.259984 113.849978-243.789399 194.548928C383.134027 654.383848 263.508509 773.284865 167.764911 773.284865l-58.892295 0c-24.068162 0-43.581588-19.526729-43.581588-43.581588s19.513426-43.581588 43.581588-43.581588l58.892295 0c60.504002 0 183.002964-121.68134 281.432741-216.784348 119.79641-115.744117 223.254713-219.029482 304.368102-219.029482l56.209186 0-59.641355-57.828057c-17.033955-16.993023-17.060561-42.902112-0.057305-59.927881 17.002232-17.030885 44.596707-17.064654 61.631686-0.065492l134.207631 133.874033c8.192589 8.172123 12.794397 19.238157 12.794397 30.803563 0 11.564383-4.601808 22.604834-12.794397 30.776957L811.706943 461.72599c-8.505721 8.486278-19.646456 12.522198-30.78719 12.522198-11.166317 0-22.333658-4.676509-30.844495-13.199627-17.003256-17.025769-16.975627-45.432749 0.057305-62.425771l59.641355-61.151755L753.564731 337.471035zM811.706943 561.66105c-17.034978-16.999163-44.629453-16.972557-61.631686 0.058328-17.003256 17.024745-16.975627 46.257533 0.057305 63.250556l59.641355 61.150732-56.209186 0c-35.793204 0-95.590102-52.946886-154.87637-108.373243-17.576307-16.435321-45.161572-16.3422-61.594847 1.226944-16.444531 17.568121-15.523555 46.393633 2.053776 62.823837 90.322122 84.458577 151.246703 131.484613 214.417441 131.484613l56.209186 0-59.641355 57.824987c-17.033955 16.993023-17.060561 43.736107-0.057305 60.761875 8.511861 8.523117 19.678178 12.369725 30.844495 12.369725 11.140735 0 22.281469-4.453429 30.78719-12.939707L945.914574 757.311055c8.192589-8.173147 12.794397-19.315928 12.794397-30.881334 0-11.564383-4.601808-22.682605-12.794397-30.855752L811.706943 561.66105zM108.871593 337.471035l58.892295 0c45.932122 0 114.40154 58.455343 168.915108 107.942431 8.352225 7.576559 18.832927 12.140505 29.29214 12.140505 11.852956 0 23.673166-4.394077 32.270984-13.857613 16.182564-17.807574 14.859429-46.823422-2.958378-62.998823-85.247546-77.381391-156.561755-130.388652-227.519854-130.388652l-58.892295 0c-24.068162 0-43.581588 19.526729-43.581588 43.581588S84.804455 337.471035 108.871593 337.471035z"></path></svg>
          </button>
          <button class="next btn" @click="this.lastSong">
            <svg class="icon" viewBox="0 0 1024 1024" xmlns="http://www.w3.org/2000/svg" width="20" height="20"><path d="M101.930375 546.0659L551.347379 872.910689a43.342807 43.342807 0 0 0 68.847075-35.055725L620.194454 695.334509 864.36350799 872.910689a43.364482 43.364482 0 0 0 68.84707601-35.055725l0-653.682354a43.350032 43.350032 0 0 0-68.847076-35.062951L620.194454 326.67138899l0-142.49877899a43.364482 43.364482 0 0 0-68.847075-35.062951l-449.41700401 326.837565a43.342807 43.342807 0 0 0 1e-8 70.118676z" fill=""></path></svg>
          </button>
        </div>
        <button class="contr-play" @click="play">
          <svg v-if="isPlay" class="icon" viewBox="0 0 1024 1024" xmlns="http://www.w3.org/2000/svg" width="20" height="20"><path d="M426.666667 138.666667v746.666666a53.393333 53.393333 0 0 1-53.333334 53.333334H266.666667a53.393333 53.393333 0 0 1-53.333334-53.333334V138.666667a53.393333 53.393333 0 0 1 53.333334-53.333334h106.666666a53.393333 53.393333 0 0 1 53.333334 53.333334z m330.666666-53.333334H650.666667a53.393333 53.393333 0 0 0-53.333334 53.333334v746.666666a53.393333 53.393333 0 0 0 53.333334 53.333334h106.666666a53.393333 53.393333 0 0 0 53.333334-53.333334V138.666667a53.393333 53.393333 0 0 0-53.333334-53.333334z" fill="#000000"></path></svg>
          <svg v-if="!isPlay" style="margin-left: 3px" class="icon" viewBox="0 0 1024 1024" xmlns="http://www.w3.org/2000/svg" width="20" height="20"><path d="M128 138.666667c0-47.232 33.322667-66.666667 74.176-43.562667l663.146667 374.954667c40.96 23.168 40.853333 60.8 0 83.882666L202.176 928.896C161.216 952.064 128 932.565333 128 885.333333v-746.666666z" fill="#000000" ></path></svg>
        </button>
        <div class="contr-top-right direction">
          <button class="next btn" @click="this.nextSong">
            <svg class="icon" viewBox="0 0 1024 1024" xmlns="http://www.w3.org/2000/svg" width="20" height="20"><path d="M922.069625 477.9341L472.652621 151.089311a43.342807 43.342807 0 0 0-68.847075 35.055725V328.665491L159.636492 151.089311a43.364482 43.364482 0 0 0-68.847076 35.055725v653.682354a43.350032 43.350032 0 0 0 68.847076 35.062951L403.805546 697.328611v142.498779a43.364482 43.364482 0 0 0 68.847075 35.062951l449.417004-326.837565a43.342807 43.342807 0 0 0 0-70.118676z" fill=""></path></svg>
          </button>
          <button class="btn" @click="isLoop">
            <svg class="icon" viewBox="0 0 1030 1024" xmlns="http://www.w3.org/2000/svg" width="20" height="20"><path d="M930.849 476.655c-19.324 0-32.041 12.883-32.041 32.042v86.71c0 109.171-86.71 199.019-199.02 199.019H202.323l41.785-38.483c6.442-6.441 12.883-16.02 12.883-25.6 0-19.324-16.02-35.344-35.345-35.344-9.579 0-22.461 3.138-28.903 9.58L83.572 804.004c-16.021 12.883-12.883 35.345 0 48.062l109.171 96.29c6.442 6.44 19.324 12.882 28.903 12.882 19.324 0 35.345-12.883 38.483-32.042 0-12.882-6.441-22.462-16.02-28.903l-48.063-44.924H696.65c147.655 0 266.405-118.75 266.405-259.964v-86.71c-0.165-19.158-13.047-32.04-32.206-32.04zM96.454 556.924c19.324 0 32.041-12.883 32.041-32.041v-89.848c0-112.31 89.848-202.158 199.02-205.296H824.98l-41.786 38.483c-6.441 6.441-12.883 16.02-12.883 25.6 0 19.324 16.02 35.344 35.345 35.344 9.58 0 22.462-3.138 28.903-9.579l105.868-99.427c16.021-12.883 12.883-35.345 0-48.062L831.257 75.81c-6.442-6.441-19.324-12.883-28.903-12.883-19.324 0-35.345 12.883-38.483 32.042 0 12.882 6.441 22.462 16.02 28.903l48.063 44.924H330.818C183.164 168.63 64.413 287.38 64.413 438.173v86.71c0 19.158 12.882 32.04 32.041 32.04z m449.239 115.448V351.463H497.63l-80.268 57.807 16.02 41.785 60.945-41.785v263.102h51.365z m0 0" fill=""></path></svg>
          </button>
        </div>
      </div>
      <div class="contr-bottom">
        <div class="play-first" style="width: 40px; color: #b3b3b3;">{{this.formatTime(firstTime) || '00:00'}}</div>
        <el-slider
          class="progress-bar"
          v-model="sliderValue"
          :show-tooltip="false"
          @change="dragChange"
        />
        <div class="play-end" style="width: 40px; color: #b3b3b3;">{{ this.formatTime(endTime) || '00:00'}}</div>
      </div>
    </div>
    <div class="player-right">
      <button>
        <svg class="icon" viewBox="0 0 1024 1024" xmlns="http://www.w3.org/2000/svg" width="20" height="20"><path d="M763 0C618.8 0 502 116.8 502 261c0 4.4 0.1 8.9 0.3 13.2L28.6 803.1c-37.5 37.5-37.5 98.3 0 135.8l56.6 56.6c18.7 18.8 43.3 28.1 67.9 28.1s49.1-9.4 67.9-28.1l528.9-473.8c4.4 0.2 8.8 0.3 13.2 0.3 144.2 0 261-116.9 261-261S907.2 0 763 0zM178.2 947.8l-1.3 1.2-1.2 1.3c-8.2 8.1-17.7 9.4-22.6 9.4s-14.5-1.2-22.6-9.4l-56.6-56.6c-12.5-12.5-12.5-32.8 0-45.3l1.3-1.2 1.2-1.3 442.2-493.6c26.4 70.8 82.6 127 153.4 153.4L178.2 947.8z m724.1-547.5c-20.7 20.7-45.3 36.3-72 46C809 454 786.3 458 763 458c-11.8 0-23.4-1-34.7-3-39.4-7-75.7-25.8-104.6-54.7S576 335.1 569 295.7c-2-11.3-3-22.9-3-34.7 0-23.3 4-46 11.7-67.3 9.7-26.8 25.2-51.3 46-72C660.9 84.5 710.4 64 763 64s102.1 20.5 139.3 57.7C939.5 158.9 960 208.4 960 261s-20.5 102.1-57.7 139.3z"></path><path d="M377.1 624.9c-12.5-12.5-12.5-32.8 0-45.3l90.5-90.5c12.5-12.5 32.8-12.5 45.3 0s12.5 32.8 0 45.3l-90.5 90.5c-12.5 12.5-32.8 12.5-45.3 0z"></path></svg>
      </button>
      <button @click="$router.push('/play/playlist')">
        <svg class="icon" viewBox="0 0 1118 1024" xmlns="http://www.w3.org/2000/svg"  width="20" height="20"><path d="M972.33052618 601.48863669L128.58052618 601.48863669C107.41007157 601.48863669 90.22825308 584.30681821 90.22825308 563.13636358 90.22825308 541.94034103 107.41007157 524.78409131 128.58052618 524.78409131L972.33052618 524.78409131C993.5009808 524.78409131 1010.68279929 541.94034103 1010.68279929 563.13636358 1010.68279929 584.30681821 993.5009808 601.48863669 972.33052618 601.48863669ZM972.33052618 269.10227255L435.39870771 269.10227255C414.22825308 269.10227255 397.04643542 251.9204549 397.04643542 230.75000027 397.04643542 209.57954565 414.22825308 192.39772717 435.39870771 192.39772717L972.33052618 192.39772717C993.5009808 192.39772717 1010.68279929 209.57954565 1010.68279929 230.75000027 1010.68279929 251.9204549 993.5009808 269.10227255 972.33052618 269.10227255ZM155.8617759 360.25284131C140.82768515 375.28693207 116.43563977 375.28693207 101.40154902 360.25284131 97.79643515 356.62215869 95.1629126 352.42897744 93.2708675 348.00568152 93.2708675 347.98011358 93.24529873 347.95454565 93.24529873 347.95454565 91.17427647 343.01988613 90.15154929 337.8039769 90.22825308 332.53693179L90.22825308 129.75568207C90.22825308 129.42329565 90.22825308 129.11647717 90.22825308 128.78409076L90.22825308 128.4772731C90.22825308 125.53693207 91.27654902 122.95454538 91.89018515 120.21875027 92.35041287 118.37784103 92.29927618 116.46022717 93.01518487 114.69602256 98.56348053 100.35227255 112.29359439 90.09943207 128.58052618 90.09943207 139.70268542 90.09943207 149.52086695 95.00852283 156.52654873 102.55113613L282.91007157 203.51988641C290.5293895 211.13920435 294.21120798 221.13636387 294.10893542 231.13352255 294.21120798 241.13068206 290.5293895 251.15340869 282.91007157 258.74715869L155.8617759 360.25284131ZM128.58052618 857.17045462L972.33052618 857.17045462C993.5009808 857.17045462 1010.68279929 874.32670435 1010.68279929 895.5227269 1010.68279929 916.69318152 993.5009808 933.875 972.33052618 933.875L128.58052618 933.875C107.41007157 933.875 90.22825308 916.69318152 90.22825308 895.5227269 90.22825308 874.32670435 107.41007157 857.17045462 128.58052618 857.17045462Z"></path></svg>
      </button>
      <button class="volume">
        <svg class="icon" viewBox="0 0 1024 1024" xmlns="http://www.w3.org/2000/svg" width="20" height="20"><path d="M512 947.2c-16 0-33.6-6.4-44.8-19.2l-224-224H160c-52.8 0-96-43.2-96-96V416c0-52.8 43.2-96 96-96h83.2l224-224c17.6-17.6 46.4-24 70.4-14.4C560 92.8 576 115.2 576 140.8v740.8c0 25.6-16 49.6-40 59.2-8 4.8-16 6.4-24 6.4zM160 384c-17.6 0-32 14.4-32 32v192c0 17.6 14.4 32 32 32h96c8 0 16 3.2 22.4 9.6L512 883.2V140.8L278.4 374.4C272 380.8 264 384 256 384h-96z m640 432c-9.6 0-17.6-3.2-24-11.2-11.2-14.4-9.6-33.6 4.8-44.8 72-62.4 115.2-152 115.2-248s-43.2-185.6-116.8-246.4c-14.4-11.2-16-32-4.8-44.8 11.2-14.4 32-16 44.8-4.8C908.8 289.6 960 396.8 960 512c0 115.2-51.2 222.4-139.2 296-6.4 4.8-14.4 8-20.8 8zM672 672c-9.6 0-19.2-4.8-25.6-12.8-11.2-14.4-8-33.6 6.4-44.8 32-24 51.2-62.4 51.2-102.4s-19.2-78.4-51.2-102.4c-14.4-11.2-17.6-30.4-6.4-44.8 11.2-14.4 30.4-17.6 44.8-6.4 48 36.8 76.8 92.8 76.8 153.6s-27.2 116.8-76.8 153.6c-6.4 4.8-12.8 6.4-19.2 6.4z"></path></svg>
        <el-slider
          class="volume-change"
          v-model="volume"
          :show-tooltip="false"
          @change="volumeChange"
        />
      </button>
      <button>
        <svg class="icon" viewBox="0 0 1024 1024" xmlns="http://www.w3.org/2000/svg" width="20" height="20"><path d="M919.272727 46.545455A34.909091 34.909091 0 0 1 954.181818 81.454545v272.104728a34.909091 34.909091 0 1 1-69.818182 0v-187.810909L613.655273 436.433455a34.792727 34.792727 0 0 1-24.669091 10.216727 34.909091 34.909091 0 0 1-24.692364-59.578182L835.025455 116.363636h-187.81091a34.909091 34.909091 0 1 1 0-69.818181H919.272727zM387.072 564.293818a34.909091 34.909091 0 1 1 49.361455 49.361455L165.725091 884.363636h187.857454a34.909091 34.909091 0 1 1 0 69.818182H81.454545A34.909091 34.909091 0 0 1 46.545455 919.272727V647.168a34.909091 34.909091 0 1 1 69.818181 0v187.810909l270.708364-270.661818z" fill="#797979"></path></svg>
      </button>
    </div>
  </div>
</template>

<style scoped lang="less">
.player{
  position: fixed;
  //top: 0;
  bottom: 0;
  width: 100%;
  z-index: 1000;
  //min-width: 800px;
  background-color: #303133;
  padding: 10px 20px 10px 20px;
  display: flex;
  justify-content: space-between;
  align-items: center;
  .player-left{
    width: 400px;
    display: flex;
    align-items: center;
    margin-bottom: 10px;
    .image{
      border-radius: 5px;
      width: 50px;
      height: 50px;
      margin-right: 10px;
    }
    .player-left-info{
      overflow: hidden;
      text-overflow: ellipsis;
      display: flex;
      flex-direction: column;
      i{
        color: #FFFFFF;
        font-size: 16px;
      }
      i:nth-child(2){
        font-size: 13px;
        //color: #EBEEF5;
      }
    }
  }
  .play-controller{
    display: flex;
    flex-direction: column;
    justify-content: center;
    width: 500px;
    .contr-top{
      display: flex;
      flex-wrap: nowrap;
      align-items: center;
      justify-content: center;
      .contr-play{
        display: flex;
        justify-content: center;
        align-items: center;
        width: 35px;
        height: 35px;
        border-radius: 50%;
        background-color: #FFFFFF;
      }
      .next{
        margin: 0 30px 0 30px;
      }
      .direction{
        .btn{
          background-color: transparent;
        }
        .icon{
          fill: currentcolor;
        }
      }
    }
    .contr-bottom{
      display: flex;
      align-items: center;
      //justify-content: center;
      justify-content: space-around;
      //flex-wrap: nowrap;
      width: 100%;
      .progress-bar{
        //margin: 0 10px 0 10px;
        width: 350px;
        height: 20px;
        display: flex;
        align-items: center;
        //.el-slider__runway{
        //  margin: 0;
        //}
      }
    }
  }
  .player-right{
    width: 400px;
    display: flex;
    align-items: center;
    justify-content: flex-end;
    button{
      background-color: transparent;
      .icon{
        fill: currentcolor;
        margin-left: 20px;
      }
      .dr{
        z-index: 1;
      }
    }
    .volume{
      display: flex;
      align-items: center;
      background-color: transparent;
      .icon{
        fill: currentcolor;
        margin-left: 20px;
      }
      .volume-change{
        margin-left: 20px;
        width: 100px;
      }
    }
  }
}
</style>
